-------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\prorgan\Box\Classes\Econ 675\Problem Sets\PS6\ps6.log
  log type:  text
 opened on:  26 Nov 2018, 14:37:54

. 
. use HeadStart.dta

. 
. * from the appendix
. * counties are treated if povrate60 >0, not treated o/w
. * outcome var is mort_related_post
. * preintervention var is more_related_pre
. * exog post var is mort_injury_post
. 
. * packages: rdrobust, rdlocrand, rddensity, rdmulti, rdpower
. 
. ********************************************************************************
. *** Question 2: The Effect of Head Start on Child Mortality
. ********************************************************************************
. * Q2.1 (a): RD Plots
. 
. * using the rdrobust package from Matias
. rdplot mort_related_pre povrate60, c(0) binselect(es) ///
>     graph_options(title("Evenly-spaced binning, IMSE-optimal")) saving("s\1_1a")

RD Plot with evenly spaced number of bins using spacings estimators.

         Cutoff c = 0 | Left of c  Right of c        Number of obs  =       2783
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |      2489         294
   Eff. Number of obs |      2489         294
  Order poly. fit (p) |         4           4
     BW poly. fit (h) |    43.990      22.372
 Number of bins scale |     1.000       1.000

Outcome: mort_related_pre. Running variable: povrate60.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |         5           6
   Average bin length |     8.798       3.729
    Median bin length |     8.798       3.729
----------------------+----------------------
    IMSE-optimal bins |         5           6
  Mimicking Var. bins |        47          43
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     1.000       1.000
    WIMSE var. weight |     0.500       0.500
    WIMSE bias weight |     0.500       0.500
---------------------------------------------


. graph export "s\1_1a.png", replace
(note: file s\1_1a.png not found)
(file s\1_1a.png written in PNG format)

. 
. rdplot mort_related_pre povrate60, c(0) binselect(esmv) ///
>     graph_options(title("Evenly-spaced binning, variability-mimicking")) saving("s\
> 1_1b")

RD Plot with evenly spaced mimicking variance number of bins using spacings estimator
> s.

         Cutoff c = 0 | Left of c  Right of c        Number of obs  =       2783
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |      2489         294
   Eff. Number of obs |      2489         294
  Order poly. fit (p) |         4           4
     BW poly. fit (h) |    43.990      22.372
 Number of bins scale |     1.000       1.000

Outcome: mort_related_pre. Running variable: povrate60.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |        47          43
   Average bin length |     0.936       0.520
    Median bin length |     0.936       0.520
----------------------+----------------------
    IMSE-optimal bins |         5           6
  Mimicking Var. bins |        47          43
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     9.400       7.167
    WIMSE var. weight |     0.001       0.003
    WIMSE bias weight |     0.999       0.997
---------------------------------------------


. graph export "s\1_1b.png", replace
(note: file s\1_1b.png not found)
(file s\1_1b.png written in PNG format)

. 
. rdplot mort_related_pre povrate60, c(0) binselect(qs) ///
>     graph_options(title("Quantile-spaced binning, IMSE-optimal"))

RD Plot with quantile spaced number of bins using spacings estimators.

         Cutoff c = 0 | Left of c  Right of c        Number of obs  =       2783
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |      2489         294
   Eff. Number of obs |      2489         294
  Order poly. fit (p) |         4           4
     BW poly. fit (h) |    43.990      22.372
 Number of bins scale |     1.000       1.000

Outcome: mort_related_pre. Running variable: povrate60.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |         5          10
   Average bin length |     8.798       2.237
    Median bin length |     7.100       1.236
----------------------+----------------------
    IMSE-optimal bins |         5          10
  Mimicking Var. bins |        44          48
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     1.000       1.000
    WIMSE var. weight |     0.500       0.500
    WIMSE bias weight |     0.500       0.500
---------------------------------------------


. graph export "s\1_1c.png", replace
(note: file s\1_1c.png not found)
(file s\1_1c.png written in PNG format)

. 
. rdplot mort_related_pre povrate60, c(0) binselect(qsmv) ///
>     graph_options(title("Quantile-spaced binning, variability mimicking"))

RD Plot with quantile spaced mimicking variance quantile spaced using spacings estima
> tors.

         Cutoff c = 0 | Left of c  Right of c        Number of obs  =       2783
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |      2489         294
   Eff. Number of obs |      2489         294
  Order poly. fit (p) |         4           4
     BW poly. fit (h) |    43.990      22.372
 Number of bins scale |     1.000       1.000

Outcome: mort_related_pre. Running variable: povrate60.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |        44          48
   Average bin length |     1.000       0.466
    Median bin length |     0.859       0.273
----------------------+----------------------
    IMSE-optimal bins |         5          10
  Mimicking Var. bins |        44          48
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     8.800       4.800
    WIMSE var. weight |     0.001       0.009
    WIMSE bias weight |     0.999       0.991
---------------------------------------------


. graph export "s\1_1d.png", replace
(note: file s\1_1d.png not found)
(file s\1_1d.png written in PNG format)

. 
end of do-file

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. twoway (hist povrate60 if povrate60 <=0, freq) ///
>            (hist povrate60 if povrate60 >0, freq
parentheses do not balance
r(198);

end of do-file

r(198);

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. twoway (hist povrate60 if povrate60 <=0, freq) ///
>            (hist povrate60 if povrate60 >0, freq)

. graph export "s\1_2i.png", replace
(note: file s\1_2i.png not found)
(file s\1_2i.png written in PNG format)

. 
end of do-file

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. twoway (hist povrate60 if povrate60 <=0, freq bcolor(black)) ///
>            (hist povrate60 if povrate60 >0, freq bcolor(red)))
) is not a twoway plot type
r(198);

end of do-file

r(198);

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. twoway (hist povrate60 if povrate60 <=0, freq bcolor(black)) ///
>            (hist povrate60 if povrate60 >0, freq bcolor(red))

. graph export "s\1_2i.png", replace
(file s\1_2i.png written in PNG format)

. 
end of do-file

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. rdwinselect povrate60, wmin(0.05) wstep(0.05) nwindows(100)
command rdwinselect is unrecognized
r(199);

end of do-file

r(199);

. net install rdlocrand, from(https://sites.google.com/site/rdpackages/rdlocrand/stat
> a) replace
checking rdlocrand consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. rdwinselect povrate60, wmin(0.05) wstep(0.05) nwindows(100)


Window selection for RD under local randomization


Cutoff c = 0.00   | Left of c   Right of c        Number of obs  =          2783
------------------+-----------------------        Order of poly  =             0
    Number of obs |      2489          294        Kernel type    =       uniform
   1st percentile |        25            3        Reps           =          1000
   5th percentile |       124           14        Testing method =     rdrandinf
  10th percentile |       249           29        Balance test   =     diffmeans
  20th percentile |       497           59


                  |   Bal. test         Var. name    Bin. test 
 Window length /2 |    p-value        (min p-value)   p-value     Obs<c   Obs>=c
------------------+-------------------------------------------------------------
            0.050 |         .                 -         1.000         1        1
            0.100 |         .                 -         1.000         3        3
            0.150 |         .                 -         1.000         4        5
            0.200 |         .                 -         0.791         6        8
            0.250 |         .                 -         0.607         6        9
            0.300 |         .                 -         1.000         9       10
            0.350 |         .                 -         1.000        11       12
            0.400 |         .                 -         1.000        12       12
            0.450 |         .                 -         1.000        15       15
            0.500 |         .                 -         0.864        18       16
            0.550 |         .                 -         0.871        20       18
            0.600 |         .                 -         1.000        20       20
            0.650 |         .                 -         1.000        21       20
            0.700 |         .                 -         0.883        24       22
            0.750 |         .                 -         0.665        26       22
            0.800 |         .                 -         0.678        28       24
            0.850 |         .                 -         0.689        30       26
            0.900 |         .                 -         0.603        32       27
            0.950 |         .                 -         0.699        32       28
            1.000 |         .                 -         0.532        35       29
            1.050 |         .                 -         0.403        39       31
            1.100 |         .                 -         0.302        43       33
            1.150 |         .                 -         0.254        44       33
            1.200 |         .                 -         0.368        44       35
            1.250 |         .                 -         0.266        46       35
            1.300 |         .                 -         0.203        51       38
            1.350 |         .                 -         0.208        52       39
            1.400 |         .                 -         0.213        53       40
            1.450 |         .                 -         0.213        53       40
            1.500 |         .                 -         0.213        53       40
            1.550 |         .                 -         0.261        54       42
            1.600 |         .                 -         0.422        54       45
            1.650 |         .                 -         0.324        57       46
            1.700 |         .                 -         0.329        58       47
            1.750 |         .                 -         0.334        59       48
            1.800 |         .                 -         0.255        62       49
            1.850 |         .                 -         0.259        63       50
            1.900 |         .                 -         0.263        64       51
            1.950 |         .                 -         0.355        64       53
            2.000 |         .                 -         0.243        69       55
            2.050 |         .                 -         0.287        70       57
            2.100 |         .                 -         0.294        72       59
            2.150 |         .                 -         0.294        72       59
            2.200 |         .                 -         0.338        72       60
            2.250 |         .                 -         0.390        73       62
            2.300 |         .                 -         0.494        73       64
            2.350 |         .                 -         0.498        74       65
            2.400 |         .                 -         0.501        75       66
            2.450 |         .                 -         0.456        78       68
            2.500 |         .                 -         0.413        80       69
            2.550 |         .                 -         0.515        80       71
            2.600 |         .                 -         0.570        80       72
            2.650 |         .                 -         0.570        80       72
            2.700 |         .                 -         0.630        81       74
            2.750 |         .                 -         0.689        81       75
            2.800 |         .                 -         0.582        85       77
            2.850 |         .                 -         0.534        87       78
            2.900 |         .                 -         0.490        90       80
            2.950 |         .                 -         0.548        93       84
            3.000 |         .                 -         0.412        96       84
            3.050 |         .                 -         0.372        97       84
            3.100 |         .                 -         0.335        98       84
            3.150 |         .                 -         0.417        98       86
            3.200 |         .                 -         0.610        98       90
            3.250 |         .                 -         0.773        99       94
            3.300 |         .                 -         0.721       101       95
            3.350 |         .                 -         0.724       103       97
            3.400 |         .                 -         0.675       106       99
            3.450 |         .                 -         0.626       107       99
            3.500 |         .                 -         0.628       108      100
            3.550 |         .                 -         0.783       108      103
            3.600 |         .                 -         0.733       110      104
            3.650 |         .                 -         0.734       111      105
            3.700 |         .                 -         0.734       111      105
            3.750 |         .                 -         0.687       114      107
            3.800 |         .                 -         0.691       117      110
            3.850 |         .                 -         0.597       119      110
            3.900 |         .                 -         0.472       123      111
            3.950 |         .                 -         0.363       126      111
            4.000 |         .                 -         0.305       130      113
            4.050 |         .                 -         0.307       131      114
            4.100 |         .                 -         0.341       132      116
            4.150 |         .                 -         0.288       137      119
            4.200 |         .                 -         0.320       138      121
            4.250 |         .                 -         0.322       139      122
            4.300 |         .                 -         0.354       139      123
            4.350 |         .                 -         0.244       143      123
            4.400 |         .                 -         0.272       144      125
            4.450 |         .                 -         0.301       144      126
            4.500 |         .                 -         0.397       144      129
            4.550 |         .                 -         0.400       146      131
            4.600 |         .                 -         0.285       151      132
            4.650 |         .                 -         0.288       153      134
            4.700 |         .                 -         0.217       156      134
            4.750 |         .                 -         0.162       160      135
            4.800 |         .                 -         0.164       161      136
            4.850 |         .                 -         0.133       163      136
            4.900 |         .                 -         0.150       164      138
            4.950 |         .                 -         0.136       166      139
            5.000 |         .                 -         0.111       169      140

Variable used in binomial test (running variable): povrate60

Note: no covariates specified.
Need to specify covariates to find recommended length.

. 
end of do-file

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. rdwinselect povrate60, wmin(0.1) wstep(0.1) nwindows(50)


Window selection for RD under local randomization


Cutoff c = 0.00   | Left of c   Right of c        Number of obs  =          2783
------------------+-----------------------        Order of poly  =             0
    Number of obs |      2489          294        Kernel type    =       uniform
   1st percentile |        25            3        Reps           =          1000
   5th percentile |       124           14        Testing method =     rdrandinf
  10th percentile |       249           29        Balance test   =     diffmeans
  20th percentile |       497           59


                  |   Bal. test         Var. name    Bin. test 
 Window length /2 |    p-value        (min p-value)   p-value     Obs<c   Obs>=c
------------------+-------------------------------------------------------------
            0.100 |         .                 -         1.000         3        3
            0.200 |         .                 -         0.791         6        8
            0.300 |         .                 -         1.000         9       10
            0.400 |         .                 -         1.000        12       12
            0.500 |         .                 -         0.864        18       16
            0.600 |         .                 -         1.000        20       20
            0.700 |         .                 -         0.883        24       22
            0.800 |         .                 -         0.678        28       24
            0.900 |         .                 -         0.603        32       27
            1.000 |         .                 -         0.532        35       29
            1.100 |         .                 -         0.302        43       33
            1.200 |         .                 -         0.368        44       35
            1.300 |         .                 -         0.203        51       38
            1.400 |         .                 -         0.213        53       40
            1.500 |         .                 -         0.213        53       40
            1.600 |         .                 -         0.422        54       45
            1.700 |         .                 -         0.329        58       47
            1.800 |         .                 -         0.255        62       49
            1.900 |         .                 -         0.263        64       51
            2.000 |         .                 -         0.243        69       55
            2.100 |         .                 -         0.294        72       59
            2.200 |         .                 -         0.338        72       60
            2.300 |         .                 -         0.494        73       64
            2.400 |         .                 -         0.501        75       66
            2.500 |         .                 -         0.413        80       69
            2.600 |         .                 -         0.570        80       72
            2.700 |         .                 -         0.630        81       74
            2.800 |         .                 -         0.582        85       77
            2.900 |         .                 -         0.490        90       80
            3.000 |         .                 -         0.412        96       84
            3.100 |         .                 -         0.335        98       84
            3.200 |         .                 -         0.610        98       90
            3.300 |         .                 -         0.721       101       95
            3.400 |         .                 -         0.675       106       99
            3.500 |         .                 -         0.628       108      100
            3.600 |         .                 -         0.733       110      104
            3.700 |         .                 -         0.734       111      105
            3.800 |         .                 -         0.691       117      110
            3.900 |         .                 -         0.472       123      111
            4.000 |         .                 -         0.305       130      113
            4.100 |         .                 -         0.341       132      116
            4.200 |         .                 -         0.320       138      121
            4.300 |         .                 -         0.354       139      123
            4.400 |         .                 -         0.272       144      125
            4.500 |         .                 -         0.397       144      129
            4.600 |         .                 -         0.285       151      132
            4.700 |         .                 -         0.217       156      134
            4.800 |         .                 -         0.164       161      136
            4.900 |         .                 -         0.150       164      138
            5.000 |         .                 -         0.111       169      140

Variable used in binomial test (running variable): povrate60

Note: no covariates specified.
Need to specify covariates to find recommended length.

. 
end of do-file

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. rdwinselect povrate60, wmin(0.05) wstep(0.05) nwindows(100)


Window selection for RD under local randomization


Cutoff c = 0.00   | Left of c   Right of c        Number of obs  =          2783
------------------+-----------------------        Order of poly  =             0
    Number of obs |      2489          294        Kernel type    =       uniform
   1st percentile |        25            3        Reps           =          1000
   5th percentile |       124           14        Testing method =     rdrandinf
  10th percentile |       249           29        Balance test   =     diffmeans
  20th percentile |       497           59


                  |   Bal. test         Var. name    Bin. test 
 Window length /2 |    p-value        (min p-value)   p-value     Obs<c   Obs>=c
------------------+-------------------------------------------------------------
            0.050 |         .                 -         1.000         1        1
            0.100 |         .                 -         1.000         3        3
            0.150 |         .                 -         1.000         4        5
            0.200 |         .                 -         0.791         6        8
            0.250 |         .                 -         0.607         6        9
            0.300 |         .                 -         1.000         9       10
            0.350 |         .                 -         1.000        11       12
            0.400 |         .                 -         1.000        12       12
            0.450 |         .                 -         1.000        15       15
            0.500 |         .                 -         0.864        18       16
            0.550 |         .                 -         0.871        20       18
            0.600 |         .                 -         1.000        20       20
            0.650 |         .                 -         1.000        21       20
            0.700 |         .                 -         0.883        24       22
            0.750 |         .                 -         0.665        26       22
            0.800 |         .                 -         0.678        28       24
            0.850 |         .                 -         0.689        30       26
            0.900 |         .                 -         0.603        32       27
            0.950 |         .                 -         0.699        32       28
            1.000 |         .                 -         0.532        35       29
            1.050 |         .                 -         0.403        39       31
            1.100 |         .                 -         0.302        43       33
            1.150 |         .                 -         0.254        44       33
            1.200 |         .                 -         0.368        44       35
            1.250 |         .                 -         0.266        46       35
            1.300 |         .                 -         0.203        51       38
            1.350 |         .                 -         0.208        52       39
            1.400 |         .                 -         0.213        53       40
            1.450 |         .                 -         0.213        53       40
            1.500 |         .                 -         0.213        53       40
            1.550 |         .                 -         0.261        54       42
            1.600 |         .                 -         0.422        54       45
            1.650 |         .                 -         0.324        57       46
            1.700 |         .                 -         0.329        58       47
            1.750 |         .                 -         0.334        59       48
            1.800 |         .                 -         0.255        62       49
            1.850 |         .                 -         0.259        63       50
            1.900 |         .                 -         0.263        64       51
            1.950 |         .                 -         0.355        64       53
            2.000 |         .                 -         0.243        69       55
            2.050 |         .                 -         0.287        70       57
            2.100 |         .                 -         0.294        72       59
            2.150 |         .                 -         0.294        72       59
            2.200 |         .                 -         0.338        72       60
            2.250 |         .                 -         0.390        73       62
            2.300 |         .                 -         0.494        73       64
            2.350 |         .                 -         0.498        74       65
            2.400 |         .                 -         0.501        75       66
            2.450 |         .                 -         0.456        78       68
            2.500 |         .                 -         0.413        80       69
            2.550 |         .                 -         0.515        80       71
            2.600 |         .                 -         0.570        80       72
            2.650 |         .                 -         0.570        80       72
            2.700 |         .                 -         0.630        81       74
            2.750 |         .                 -         0.689        81       75
            2.800 |         .                 -         0.582        85       77
            2.850 |         .                 -         0.534        87       78
            2.900 |         .                 -         0.490        90       80
            2.950 |         .                 -         0.548        93       84
            3.000 |         .                 -         0.412        96       84
            3.050 |         .                 -         0.372        97       84
            3.100 |         .                 -         0.335        98       84
            3.150 |         .                 -         0.417        98       86
            3.200 |         .                 -         0.610        98       90
            3.250 |         .                 -         0.773        99       94
            3.300 |         .                 -         0.721       101       95
            3.350 |         .                 -         0.724       103       97
            3.400 |         .                 -         0.675       106       99
            3.450 |         .                 -         0.626       107       99
            3.500 |         .                 -         0.628       108      100
            3.550 |         .                 -         0.783       108      103
            3.600 |         .                 -         0.733       110      104
            3.650 |         .                 -         0.734       111      105
            3.700 |         .                 -         0.734       111      105
            3.750 |         .                 -         0.687       114      107
            3.800 |         .                 -         0.691       117      110
            3.850 |         .                 -         0.597       119      110
            3.900 |         .                 -         0.472       123      111
            3.950 |         .                 -         0.363       126      111
            4.000 |         .                 -         0.305       130      113
            4.050 |         .                 -         0.307       131      114
            4.100 |         .                 -         0.341       132      116
            4.150 |         .                 -         0.288       137      119
            4.200 |         .                 -         0.320       138      121
            4.250 |         .                 -         0.322       139      122
            4.300 |         .                 -         0.354       139      123
            4.350 |         .                 -         0.244       143      123
            4.400 |         .                 -         0.272       144      125
            4.450 |         .                 -         0.301       144      126
            4.500 |         .                 -         0.397       144      129
            4.550 |         .                 -         0.400       146      131
            4.600 |         .                 -         0.285       151      132
            4.650 |         .                 -         0.288       153      134
            4.700 |         .                 -         0.217       156      134
            4.750 |         .                 -         0.162       160      135
            4.800 |         .                 -         0.164       161      136
            4.850 |         .                 -         0.133       163      136
            4.900 |         .                 -         0.150       164      138
            4.950 |         .                 -         0.136       166      139
            5.000 |         .                 -         0.111       169      140

Variable used in binomial test (running variable): povrate60

Note: no covariates specified.
Need to specify covariates to find recommended length.

. 
end of do-file

. net install rddensity, from(https://sites.google.com/site/rdpackages/rddensity/stat
> a) replace
checking rddensity consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. rddensity povrate60, c(0)
Computing data-driven bandwidth selectors.

RD Manipulation Test using local polynomial density estimation.

      Cutoff c = 0 |Left of c   Right of c          Number of obs =         2783
-------------------+----------------------          Model         = unrestricted
     Number of obs |      2489         294          BW method     =         comb
Eff. Number of obs |       331         211          Kernel        =   triangular
    Order est. (p) |         2           2          VCE method    =    jackknife
    Order bias (q) |         3           3
       BW est. (h) |     9.585       8.469

Running variable: povrate60.
-----------------------------------------------
            Method |          T        P>|T|
-------------------+---------------------------
            Robust |      -0.4692      0.6389
-----------------------------------------------


. 
end of do-file

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. rddensity povrate60, all
Computing data-driven bandwidth selectors.

RD Manipulation Test using local polynomial density estimation.

      Cutoff c = 0 |Left of c   Right of c          Number of obs =         2783
-------------------+----------------------          Model         = unrestricted
     Number of obs |      2489         294          BW method     =         comb
Eff. Number of obs |       331         211          Kernel        =   triangular
    Order est. (p) |         2           2          VCE method    =    jackknife
    Order bias (q) |         3           3
       BW est. (h) |     9.585       8.469

Running variable: povrate60.
-----------------------------------------------
            Method |          T        P>|T|
-------------------+---------------------------
      Conventional |       0.1955      0.8450
            Robust |      -0.4692      0.6389
-----------------------------------------------


. 
end of do-file

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. rddensity povrate60, all hl(5) hr(5)
option hl() not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. rddensity povrate60, all h(5 5)

RD Manipulation Test using local polynomial density estimation.

      Cutoff c = 0 |Left of c   Right of c          Number of obs =         2783
-------------------+----------------------          Model         = unrestricted
     Number of obs |      2489         294          BW method     =       manual
Eff. Number of obs |       169         140          Kernel        =   triangular
    Order est. (p) |         2           2          VCE method    =    jackknife
    Order bias (q) |         3           3
       BW est. (h) |     5.000       5.000

Running variable: povrate60.
-----------------------------------------------
            Method |          T        P>|T|
-------------------+---------------------------
      Conventional |      -0.9798      0.3272
            Robust |      -1.6268      0.1038
-----------------------------------------------


. 
end of do-file

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. rddensity povrate60, all h(1 1)

RD Manipulation Test using local polynomial density estimation.

      Cutoff c = 0 |Left of c   Right of c          Number of obs =         2783
-------------------+----------------------          Model         = unrestricted
     Number of obs |      2489         294          BW method     =       manual
Eff. Number of obs |        35          29          Kernel        =   triangular
    Order est. (p) |         2           2          VCE method    =    jackknife
    Order bias (q) |         3           3
       BW est. (h) |     1.000       1.000

Running variable: povrate60.
-----------------------------------------------
            Method |          T        P>|T|
-------------------+---------------------------
      Conventional |       0.3943      0.6934
            Robust |       0.7139      0.4753
-----------------------------------------------


. 
end of do-file

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. rdplot mort_related_pre povrate60, c(0) binselect(es) ///
>     graph_options(title("Evenly-spaced binning, IMSE-optimal")) saving("s\1_1a")

RD Plot with evenly spaced number of bins using spacings estimators.

         Cutoff c = 0 | Left of c  Right of c        Number of obs  =       2783
----------------------+----------------------        Kernel         =    Uniform
        Number of obs |      2489         294
   Eff. Number of obs |      2489         294
  Order poly. fit (p) |         4           4
     BW poly. fit (h) |    43.990      22.372
 Number of bins scale |     1.000       1.000

Outcome: mort_related_pre. Running variable: povrate60.
---------------------------------------------
                      | Left of c  Right of c
----------------------+----------------------
        Bins selected |         5           6
   Average bin length |     8.798       3.729
    Median bin length |     8.798       3.729
----------------------+----------------------
    IMSE-optimal bins |         5           6
  Mimicking Var. bins |        47          43
----------------------+----------------------
Rel. to IMSE-optimal: | 
        Implied scale |     1.000       1.000
    WIMSE var. weight |     0.500       0.500
    WIMSE bias weight |     0.500       0.500
---------------------------------------------


. graph export "s\1_1a.png", replace
(file s\1_1a.png written in PNG format)

. 
end of do-file

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. rddensity povrate60, all /// default settings

end of do-file

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. rddensity povrate60, all h(5 5) /// playing around with bandwidth

end of do-file

. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. rddensity povrate60, all /// default settings

end of do-file

. rddensity povrate60
Computing data-driven bandwidth selectors.

RD Manipulation Test using local polynomial density estimation.

      Cutoff c = 0 |Left of c   Right of c          Number of obs =         2783
-------------------+----------------------          Model         = unrestricted
     Number of obs |      2489         294          BW method     =         comb
Eff. Number of obs |       331         211          Kernel        =   triangular
    Order est. (p) |         2           2          VCE method    =    jackknife
    Order bias (q) |         3           3
       BW est. (h) |     9.585       8.469

Running variable: povrate60.
-----------------------------------------------
            Method |          T        P>|T|
-------------------+---------------------------
            Robust |      -0.4692      0.6389
-----------------------------------------------


. rddensity povrate60, all
Computing data-driven bandwidth selectors.

RD Manipulation Test using local polynomial density estimation.

      Cutoff c = 0 |Left of c   Right of c          Number of obs =         2783
-------------------+----------------------          Model         = unrestricted
     Number of obs |      2489         294          BW method     =         comb
Eff. Number of obs |       331         211          Kernel        =   triangular
    Order est. (p) |         2           2          VCE method    =    jackknife
    Order bias (q) |         3           3
       BW est. (h) |     9.585       8.469

Running variable: povrate60.
-----------------------------------------------
            Method |          T        P>|T|
-------------------+---------------------------
      Conventional |       0.1955      0.8450
            Robust |      -0.4692      0.6389
-----------------------------------------------


. do "C:\Users\prorgan\AppData\Local\Temp\STD1d94_000000.tmp"

. rddensity povrate60, all
Computing data-driven bandwidth selectors.

RD Manipulation Test using local polynomial density estimation.

      Cutoff c = 0 |Left of c   Right of c          Number of obs =         2783
-------------------+----------------------          Model         = unrestricted
     Number of obs |      2489         294          BW method     =         comb
Eff. Number of obs |       331         211          Kernel        =   triangular
    Order est. (p) |         2           2          VCE method    =    jackknife
    Order bias (q) |         3           3
       BW est. (h) |     9.585       8.469

Running variable: povrate60.
-----------------------------------------------
            Method |          T        P>|T|
-------------------+---------------------------
      Conventional |       0.1955      0.8450
            Robust |      -0.4692      0.6389
-----------------------------------------------


. 
end of do-file

